core/app/Http/Controllers/GoogleController.php

select * from `users` where `email` = 'gunjonarka@gmail.com' limit 1
---
    public function callbackToGoogle(Request $request)
    {
        try {
            $user = Socialite::driver('google')->user();

            $findUser = User::where('email', $user->email)->first();