core/app/Http/Controllers/HomeController.php

    public function home()
    {
        $sliders = Slider::with('media')
            ->where(['status' => Status::ACTIVE])
            ->orderBy('order_column')
            ->get();
        $products = Product::with('media')
            ->where(['status' => Status::ACTIVE])
            ->orderBy('order_column')
            ->get();
---
select * from `sliders` where (`status` = 1) order by `order_column` asc
select * from `products` where (`status` = 1) order by `order_column` asc

    public function topup(string $slug)
    {
        $product = Product::with(['variations.vouchers' => function ($query) {
            $query->where('status', Status::AVAILABLE);
        }])->where('status', Status::ACTIVE)->where(['slug' => $slug])->first();
---
select * from `products` where `status` = 1 and (`slug` = 'level-up-pass-bd') limit 1
select * from `variations` where `variations`.`product_id` in (11)
select * from `vouchers` where `vouchers`.`variation_id` in (70, 71) and `status` = 1

    public function getPopups(Request $request)
    {
        $collection = new Collection();

        if (!$request->session()->has('first_visit_popup')) {
            $firstVisitPopups = Popup::where('type', Status::ONCE)
                ->where('status', Status::ACTIVE)
                ->get();
            $collection = $collection->merge($firstVisitPopups);
            $request->session()->put('first_visit_popup', true);
        }

        if (!$request->cookie('daily_popup_showed')) {
            $dailyOncePopups = Popup::where('type', Status::DAILY)
                ->where('status', Status::ACTIVE)
                ->get();
---
select * from `popups` where `type` = 'once' and `status` = 1
select * from `popups` where `type` = 'once' and `status` = 1 and `type` = 'daily' and `status` = 1