core/app/Services/OrderService.php

    public function addOrder(Request $request)
    {
        $variation = Variation::where('stock', '>', 0)
            ->with(['product', 'vouchers' => function ($query) {
                $query->where('status', Status::AVAILABLE);
            }])
            ->findOrFail($request->variation_id);
---
select * from `products` where `products`.`id` in (11)
select * from `variations` where `stock` > 0 and `variations`.`id` = '70' limit 1
select * from `vouchers` where `vouchers`.`variation_id` in (70) and `status` = 1


        try {
            $order = DB::transaction(function () use ($orderData) {
                return Order::create($orderData);
---
insert into `orders` (`user_id`, `product_id`, `variation_id`, `quantity`, `amount`, `profit`, `track_id`, `account_info`, `updated_at`, `created_at`) values (1, 11, 70, 1, 22, 0, 'D1MAFVFP31QG', '{\"player_id\":\"1915807809\"}', '2026-06-29 03:40:52', '2026-06-29 03:40:52')

            return back()->with('error', __('Something went wrong.'));
        }

        $order = Order::where('id', $order->id)->orderBy('id', 'DESC')->with(['user', 'variation', 'product'])->first();
---
select * from `orders` where `id` = 39 and `orders`.`deleted_at` is null order by `id` desc limit 1
select * from `products` where `products`.`id` in (11)
select * from `users` where `users`.`id` in (1)
select * from `variations` where `variations`.`id` in (70)

    public function gatewayIpn(Request $request, string $trx, string $gateway)
    {
        try {
            $order = Order::where('track_id', $trx)->orderBy('id', 'DESC')->with(['user', 'variation', 'product'])->first();
---
select * from `orders` where `track_id` = 'NB7D95964SA3' and `orders`.`deleted_at` is null order by `id` desc limit 1
select * from `products` where `products`.`id` in (11)
select * from `users` where `users`.`id` in (3938)
select * from `variations` where `variations`.`id` in (70)

    public function completeOrder(Order $order, string $paymentMethod, string $transactionId, ?Voucher $vouchers = null)
    {
        $exists = Transaction::where('transaction_id', $transactionId)->exists();
        if ($exists) {
            throw new \Exception(__('Transaction ID already exists.'));
        }

        $variation = Variation::where('stock', '>', 0)->with(['product', 'vouchers' => function ($query) {
            $query->where('status', Status::AVAILABLE);
        }])->find($order->variation_id);
---
select exists(select * from `transactions` where `transaction_id` = 'DFT8SQQB20') as `exists`
select * from `products` where `products`.`id` in (11)
select * from `variations` where `stock` > 0 and `variations`.`id` = 70 limit 1
select * from `vouchers` where `vouchers`.`variation_id` in (70) and `status` = 1

    private function completeDeposit(Order $order, string $paymentMethod, string $transactionId)
    {
        DB::transaction(function () use ($order, $paymentMethod, $transactionId) {
            // Credit wallet
            $user = $order->user;
            $user->balance += $order->amount;
            $user->save();

            // Create Deposit record
            $deposit = new Deposit();
            $deposit->user_id  = $order->user_id;
            $deposit->amount   = $order->amount;
            $deposit->track_id = strRandom();
            $deposit->status   = Status::PAID;
            $deposit->save();

            // Add Transaction
            $transaction = new Transaction();
            $transaction->user_id        = $order->user_id;
            $transaction->deposit_id     = $deposit->id;
            $transaction->trx_type       = Status::DEBIT;
            $transaction->amount         = $order->amount;
            $transaction->payment_method = $paymentMethod;
            $transaction->remarks        = 'Wallet topped up due to out-of-stock product via ' . $paymentMethod;
            $transaction->transaction_id = $transactionId;
            $transaction->save();
---
update `users` set `balance` = 10, `users`.`updated_at` = '2026-06-29 04:33:58' where `id` = 3938
insert into `deposits` (`user_id`, `amount`, `track_id`, `status`, `updated_at`, `created_at`) values (3938, '10.00', 'RSUBU45Q3YBW', 'paid', '2026-06-29 04:33:58', '2026-06-29 04:33:58')
insert into `transactions` (`user_id`, `deposit_id`, `trx_type`, `amount`, `payment_method`, `remarks`, `transaction_id`, `updated_at`, `created_at`) values (3938, 9, '+', '10.00', 'Bkash Personal', 'Wallet topped up due to out-of-stock product via Bkash Personal', 'DFT8SQQB20', '2026-06-29 04:33:58', '2026-06-29 04:33:58')

    private function addTransactionId(int $order_id, string $transactionId): void
    {
        $vouchers = Voucher::where('order_id', $order_id)->get();
        $autovouchers = AutoVoucher::where('order_id', $order_id)->get();
---
select * from `vouchers` where `order_id` = 48
select * from `auto_vouchers` where `order_id` = 48