core/app/Providers/AppServiceProvider.php

select * from `menus` where `status` = 1 order by `order_column` asc
select * from `pages` where `status` = 1 order by `order_column` asc
---
    public function boot(): void
    {
        $this->ensureStorageDirectories();

        $viewShare['settings'] = gs();
        view()->share($viewShare);

        try {
            View::composer('layouts.app', function ($view) {
                $pages = Page::where('status', Status::ACTIVE)
                    ->orderBy('order_column')
                    ->get();
                $menus = Menu::where('status', Status::ACTIVE)
                    ->orderBy('order_column')
                    ->get();
                $view->with('pages', $pages);
                $view->with('menus', $menus);
            });