core/app/Filament/Widgets/CustomersChart.php

select MONTH(created_at) as month, COUNT(*) as customer_count from `users` where year(`created_at`) = 2026 and `role` = 'user' group by MONTH(created_at) order by `month` asc
---
    protected function getData(): array
    {
        $currentYear = now()->year;

        $monthlyCustomerCounts = User::whereYear('created_at', $currentYear)
            ->where('role', Role::USER)
            ->select(
                DB::raw('MONTH(created_at) as month'),
                DB::raw('COUNT(*) as customer_count')
            )
            ->groupBy(DB::raw('MONTH(created_at)'))
            ->orderBy('month')
            ->get();