core/app/Filament/Widgets/StatsOverviewWidget.php

    private function calculateRevenueIncreaseByDate(): array
    {
        $currentRevenue = Order::whereMonth('created_at', now()->month)
            ->whereYear('created_at', now()->year)
            ->where('status', Status::COMPLETED)
            ->sum('amount');
        $previousRevenue = Order::whereMonth('created_at', now()->subMonth()->month)
            ->whereYear('created_at', now()->subMonth()->year)
            ->where('status', Status::COMPLETED)
            ->sum('amount');
---
select sum(`amount`) as aggregate from `orders` where month(`created_at`) = '06' and year(`created_at`) = 2026 and `status` = 'completed' and `orders`.`deleted_at` is null
select sum(`amount`) as aggregate from `orders` where month(`created_at`) = '05' and year(`created_at`) = 2026 and `status` = 'completed' and `orders`.`deleted_at` is null

    private function calculateOrderIncreaseByDate(): array
    {
        $currentOrders = Order::whereMonth('created_at', now()->month)
            ->whereYear('created_at', now()->year)
            ->count();
        $previousOrders = Order::whereMonth('created_at', now()->subMonth()->month)
            ->whereYear('created_at', now()->subMonth()->year)
            ->count();
---
select count(*) as aggregate from `orders` where month(`created_at`) = '06' and year(`created_at`) = 2026 and `orders`.`deleted_at` is null
select count(*) as aggregate from `orders` where month(`created_at`) = '05' and year(`created_at`) = 2026 and `orders`.`deleted_at` is null

    private function calculateUserIncreaseByDate(): array
    {
        $currentUsers = User::whereMonth('created_at', now()->month)
            ->whereYear('created_at', now()->year)
            ->where('role', Role::USER)
            ->count();
        $previousUsers = User::whereMonth('created_at', now()->subMonth()->month)
            ->whereYear('created_at', now()->subMonth()->year)
            ->where('role', Role::USER)
            ->count();
---
select count(*) as aggregate from `users` where month(`created_at`) = '06' and year(`created_at`) = 2026 and `role` = 'user'
select count(*) as aggregate from `users` where month(`created_at`) = '05' and year(`created_at`) = 2026 and `role` = 'user'