core/app/Services/TopupProvider/Validators/StockValidator.php

    private function localStockCheck(Variation $variation): bool
    {
        $autoVoucherCount = AutoVoucher::where('variation_id', $variation->id)
            ->where('status', 1)
            ->count();
---
select count(*) as aggregate from `auto_vouchers` where `variation_id` = 70 and `status` = 1