core/app/Helpers/ActivityLogger.php

insert into `activity_log` (`log_name`, `description`, `subject_type`, `subject_id`, `causer_type`, `causer_id`, `properties`, `event`, `updated_at`, `created_at`) values ('user', 'User Talha Rahman updated - {\"balance\":{\"from\":\"0.00\",\"to\":10}}', 'App\Models\User', 3938, 'App\Models\User', 3938, '{\"balance\":{\"from\":\"0.00\",\"to\":10}}', 'updated', '2026-06-29 04:33:58', '2026-06-29 04:33:58')
---
    public static function log(
        string $description,
        ?Model $subject = null,
        ?User $causer = null,
        ?string $logName = 'default',
        ?string $event = null,
        ?array $properties = null
    ): ActivityLog {
        $causer = $causer ?? (auth()->check() ? auth()->user() : null);

        return ActivityLog::create([
            'log_name' => $logName,
            'description' => $description,
            'subject_type' => $subject ? get_class($subject) : null,
            'subject_id' => $subject?->getKey(),
            'causer_type' => $causer ? User::class : null,
            'causer_id' => $causer?->getKey(),
            'properties' => $properties,
            'event' => $event,
        ]);